* Configuration
#+PROPERTY: header-args :tangle yes
* Strategy
- try to fetch information from the public help page instead of
  locally installed documents (not working for dynprompt.ans
  stuff! :-/ )
- Anys licensing / legal notices / terms and conditions / terms of use
  software license agreement 2021
- confidental information
- makefile for testing local workflow
- build helper files -> /prepare
- build -keywords.el

* Git
branch names of worktrees: apdl-mode- 20.6.0 -> 20, 24, 25 remove time
stamps

   - htrssv3: ~/a-m branch current master
     reverted apdl-process.el trying asynchronous license process
	 ;; asynchronous call
	 (async-start-process proc-name apdl-lmutil-program nil
     - ~/apdl-mode started 2025-05
   - urmel: ~/a-m master b1e372e tag 20.6.0!
     - ~/apdl-mode started git repo in 2025-05 as "simplified apdl-mode"
   - github.com 2023-10-22 b1e372e
   - melpa
     - stable: 20.5.0 2020-05-01 updated to 20.7.0?
     - unstable 21.1 b1e372e 2022-02-11 apdl-mode version 20.7
   - VT enterprise gh 2023-10-21 Readme

* Todo
master cherry pick fix
release 20.7.0 with bug fix -> 24.0 (25.0?)

Release proceedures in info/TODO.org
1) complete commands without arguments from dynprompt241.ans
2) elements with tooltips (suggestion for deprecated)
3) Apdl_commands_without_arguments aren't yet indicated/warned

OK: "%" %does not work in pairs%  <- use C-c % ;-)
** Help path
strategy:
1) local help
2) - online help

* Release proceedure
We need dynpromptXXX.ans from an Mechanical installation the rest can
be found on Ansys' public help site

1) e.g. ansys_inc/162.0/v162/ansys/docu/dynprompt162.ans

** Preparations                                                      :manual:
Installation path, manually maintained variables, helper functions, helper files
*** Search and use latest installed Ansys Version
#+begin_src elisp
    (defun apdl-find-path-environment-value ()
      "Find the latest AWP_ROOTXXX environment value.
    	  Which is to say find the Ansys root path with the largest
    	  installed versioning number and check the accessibility of the
    	  content."
      (let ((dir
    	 (car
    	  (reverse
    	   (sort
    	    (remove nil
    		    (mapcar (lambda (str)
    			      (when
    				  (string-match
    				   "AWP_ROOT[0-9][0-9][0-9]=\\(.*\\)"
    				   str)
    				(match-string 1 str)))
    			    process-environment))
    	    'string<)))))
        (if (null dir)
    	(progn
    	  (message "No AWP_ROOTXXX environment variable")
    	  nil)
          (if (file-readable-p dir)
    	  (progn
    	    (message "Found Ansys root directory in environment: %s" dir)
    	    dir)
    	(message "Environment AWP_ROOTXXX set but value is not readable")
    	nil))))

    (setq Installation-folder (directory-file-name (apdl-find-path-environment-value)))
    (setq Ansys-version (remove ?v (downcase (file-name-base Installation-folder))))

    ;; info
    (message (concat "Using Ansys installation in " Installation-folder))

#+end_src

#+RESULTS:
: Using Ansys installation in c:/CAx/App/ANSYS_Inc/v252

*** Undocumented and archived commands
manual: Check undocumented commands -> customer portal old (archived)
version release notes!?  no undocumented commands in the 24.1 and 25.1
releases:
file:c:/CAx/App/ANSYS_Inc/v241/commonfiles/help/en-us/help/mapdl_releasenotes/rncmdchg.html

DONE V241 archived commands add to undocumented  commands (help only in archived section)

archived commands:
https://ansyshelp.ansys.com/account/secured?returnurl=/Views/Secured/corp/v251/en/ans_arch/archlegacycommands.html

#+begin_src elisp
  (defconst Apdl_undocumented_commands    ; or macros or archived commands
    '(
      "*EVAL"                             ; Ansys 11.0
      "*MOONEY"                           ; Ansys 11.0
      "*PREAD"			   ;in .parm file from PARSAV
      "/OPT"                              ; v14
      "/PICE"
      "/PMETH"
      "/RUNST"
      "/RUNSTAT"                          ; 13.0
      "/SSS"                              ; scale plot values /sss,3
      "/TRACK"
      "/VERIFY"                           ; verification run?
      "/VT"
      "/WB"                     ; signify a WB generated input file
      "/XML"
      "ALPFILL"
      "ARCOLLAPSE"
      "ARDETACH"
      "ARFILL"
      "ARMERGE"
      "ARSPLIT"
      "ASLN"
      "BELLOW"
      "BEND"
      "BRANCH"
      "CECYC"
      "CEWRITE" ; .dat: ansys.net: write out constraint equations into jobname.ce
      "CMBLOCK"
      "CNTR" ; ,print,1 ! print out contact info and also make no ; initial contact an error
      "CRPLIM"
      "CWZPLOT"
      "EALL"   ; esel,all? (WorkBench 10.0)
      "EBLOCK"
      "END"			   ;in .parm file
      "EQSLV"
      "FATIGUE"
      "FE"
      "FELIST"
      "FIPLOT"
      "FL"
      "FLANGE"
      "FLDATA1-40"                        ; beginning of 15.0
      "FLITEM" ; log command
      "FLLIST"
      "FLOCHECK"
      "FLOTRAN"
      "FLREAD"
      "FMAGSUM"				; v201
      "FP"
      "FPLIST"
      "FS"
      "FSDELE"
      "FSLIST"
      "FSNODE"
      "FSPLOT"
      "FTCALC"
      "FTSIZE"
      "FTWRITE"
      "GAP"
      "GAPF"
      "GAPFINISH"
      "GAPLIST"
      "GAPMERGE"
      "GAPOPT"
      "GAPPLOT"
      "GP"
      "GPDELE"
      "GPLIST"
      "HFADP"
      "HFARRAY"
      "HFDEEM"
      "HFEIGOPT"
      "HFEREFINE"
      "HFMODPRT"
      "HFPA"
      "HFPCSWP"
      "HFPORT"
      "HFPOWER"
      "HFSCAT"
      "ICE"
      "ICEDELE"
      "ICELIST"
      "ICVFRC"
      "KCALC"
      "LNCOLLAPSE"
      "LNDETACH"
      "LNFILL"
      "LNMERGE"
      "LNSPLIT"
      "LPRT"
      "LSLN"
      "MITER"
      "MSADV"
      "MSCAP"
      "MSDATA"
      "MSMASS"
      "MSMETH"
      "MSMIR"
      "MSNOMF"
      "MSPROP"
      "MSQUAD"
      "MSRELAX"
      "MSSOLU"
      "MSSPEC"
      "MSTERM"
      "MSVARY"
      "NALL"   ; nsel,all? (WB 10.0)
      "NBLOCK"
      "NELE"   ; predecessor of NSLE, NELE (WorkBench 10.0 output) still working in Ansys 11.0 though
      "OPADD"
      "OPANL"
      "OPCLR"
      "OPDATA"
      "OPDEL"
      "OPEQN"
      "OPEXE"
      "OPFACT"
      "OPFRST"
      "OPGRAD"
      "OPKEEP"
      "OPLFA"
      "OPLGR"
      "OPLIST"
      "OPLOOP"
      "OPLSW"
      "OPMAKE"
      "OPPRNT"
      "OPRAND"
      "OPRESU"
      "OPRFA"
      "OPRGR"
      "OPRSW"
      "OPSAVE"
      "OPSEL"
      "OPSUBP"
      "OPSWEEP"
      "OPTYPE"
      "OPUSER"
      "OPVAR"
      "PCONV"
      "PCORRO"
      "PDRAG"
      "PEMOPTS"
      "PERI"
      "PEXCLUDE"
      "PFLUID"
      "PGAP"
      "PGRAPH"
      "PGRSET"
      "PGSAVE"
      "PGSELE"
      "PGWRITE"
      "PILECALC"
      "PILEDISPSET"
      "PILEGEN"
      "PILELOAD"
      "PILEMASS"
      "PILERUN"
      "PILESEL"
      "PILESTIF"
      "PINCLUDE"
      "PINSUL"
      "PIPE"
      "PLCONV"
      "PLCRACK"
      "PLFSS"
      "PLSCH"
      "PLSYZ"
      "PLTD"
      "PLTLINE"
      "PLVAROPT"
      "PLVFRC"
      "PLWAVE"
      "PMETH"
      "PMOPTS"
      "POPT"
      "POUTRES"
      "PPLOT"
      "PPRANGE"
      "PPRES"
      "PRCONV"
      "PRECISION"
      "PRSYZ"                             ; endo of v150
      "PRVAROPT"
      "PSOLVE"
      "PSOLVE"
      "PSPEC"
      "PSPRNG"
      "PTEMP"
      "PUNIT"
      "QFACT"
      "RALL"
      "REDUCE"
      "RFILSZ"
      "RITER"
      "RMEMRY"
      "RSPEED"
      "RSTAT"
      "RTIMST"
      "RUN"
      "RWFRNT"
      "SARPLOT"
      "SHSD"
      "SLPPLOT"
      "SLSPLOT"
      "SOLCONTROL"
      "SPADP"
      "SPARM"
      "SPFSS"
      "SPICE"
      "SPSCAN"
      "SPSWP"
      "SSTIF"
      "TEE"
      "TOCOMP"
      "TODEF"
      "TOEXE"
      "TOFREQ"
      "TOGRAPH"
      "TOLIST"
      "TOLOOP"
      "TOPLOT"
      "TOPRINT"
      "TOSTAT"
      "TOTAL"
      "TOTYPE"
      "TOVAR"
      "TZAMESH"
      "TZDELE"
      "TZEGEN"
      "VALVE"
      "VCVFILL"
      "VTCLR"
      "VTDISC"
      "VTEVAL"
      "VTFREQ"
      "VTGEOM"
      "VTIN"
      "VTMETH"
      "VTMP"
      "VTOP"
      "VTPOST"
      "VTREAL"
      "VTRFIL"
      "VTRSLT"
      "VTSEC"
      "VTSFE"
      "VTSL"                              ; end of 14.5
      "VTSTAT"
      "VTTEMP"
      "VTVMOD"
      "XMLO"
      "XVAROPT"                    ; v14 end
      "~CFIN"                             ; Ansys 11.0
      "~EUI"
      )
    "APDL commands not documented or achived in the manuals.
  	  Either from dropped technologies or seen in Workbench output
  	  files, old macros or APDL verification models.")
#+end_src

#+RESULTS:
: Apdl_undocumented_commands

*** Commands which must be written out
manual: Apdl_written_out_commands, can't be abbreviated, where did I
get them from (testing)?

#+begin_src elisp
    (defconst Apdl_written_out_commands
      '(
        "*ELSEIF"                         ; allows arguments behind it
        "*END"
        "*ENDIF"
        "*ENDDO"
        "/POST1"
        "/POST26"
        "/PREP7"
        )
      "Commands which aren't allowed to be abbreviated.
    	  And the solver won't allow characters appended to.")

#+end_src

#+RESULTS:
: Apdl_written_out_commands

*** Commands without arguments
Script?: Apdl_commands_without_arguments' <- dynprompt241.ans not
(yet) used in apdl-mode!

# ######################################################################
Manual definition of Apdl_commands_without_arguments
Apdl_commands_without_arguments variable is not (yet) indicated in
apdl-mode :-/

#+begin_src elisp
     (defconst Apdl_commands_without_arguments
       '(
         "*ENDIF"
         "*ENDDO"
         "*END"
         "*CFCLOS"
         "*CYCLE"
         "*ELSE"
         "*EXIT"
         "/PMACRO"
         "*VSTAT"
         "/AUX2"
         "/AUX3"
         "/AUX12"
         "/AUX15"
         "/POST1"
         "/POST26"
         "/PREP7"
         "SSUM"
         ;; added from v252
         ;; "*ENDPY" ; new
         ;; "*PYTHON" ; new
         "/EOF"
         "/ERASE"
         "/FCLEAN"
         "/GO"
         "/GOLIST"
         "/GOPR"
         "/MAP"
         "/NOERASE"
         "/NOLIST"
         "/NOPR"
         "/QUIT"
         "/RESET"
         "/SOLU"
         "AFLIST"
         "AREAS"
         "ATYPE"
         "BFTRAN"
         "BIOOPT"
         "BOOL"
         "CALC"
         "CEQN"
         "CLRMSHLN"
         "COMPRESS"
         "COUPLE"
         "CURR2D"
         "DATADEF"
         "DEACT"
         "DEFINE"
         "DISPLAY"
         "DTRAN"
         "DYNOPT"
         "ECPCHG"
         "EEMBED"
         "ELEM"
         "EMAGERR"
         "EMF"
         "EMFT"
         "EPLOT"
         "ERASE"
         "ETYPE"
         "EUSORT"
         "FCCHECK"
         "FEBODY"
         "FECONS"
         "FEFOR"
         "FESURF"
         "FINISH"
         "FLUXV"
         "FTRAN"
         "GENOPT"
         "GEOMETRY"
         "GPLOT"
         "GSUM"
         "ICDELE"
         "INRTIA"
         "IRLIST"
         "KEYPTS"
         "KEYW"
         "KSUM"
         "LCCALC"
         "LCZERO"
         "LINE"
         "LSOPER"
         "LSUM"
         "MASTER"
         "MATER"
         "MESHING"
         "MMF"
         "NLOPT"
         "NODES"
         "NUSORT"
         "OPERATE"
         "OUTOPT"
         "PAUSE"
         "PLORB"
         "PLOTTING"
         "POINT"
         "POLY"
         "POWERH"
         "PRERR"
         "PRIM"
         "PRINT"
         "PRITER"
         "RCON"
         "RESET"
         "RMFLVEC"
         "SBCLIST"
         "SBCTRAN"
         "SELM"
         "SFTRAN"
         "SMBODY"
         "SMCONS"
         "SMFOR"
         "SMSURF"
         "SOLUOPT"
         "SORT"
         "SPEC"
         "SPTOPT"
         "STAT"
         "TBLE"
         "UNPAUSE"
         "VOLUMES"
         "WSPRINGS"
         )
       "APDL commands which aren't allowed with arguments.")

#+end_src

#+RESULTS:
: Apdl_commands_without_arguments

Search dynprompt commands without arguments:
#+begin_src elisp :tangle no
  (let* (
  	 (Base "c:/CAx/App/")
  	 (Version "252")
  	 (Folder (concat Base "ANSYS_Inc/v" Version "/ansys/docu/") )
  	 (Dynprompt-file (concat Folder "dynprompt" Version ".ans") )
  	 )
      (with-temp-buffer
  	(message "Searching commands without arguments")
  	(insert-file-contents Dynprompt-file)
  	(goto-char (point-min))
  	(while (re-search-forward "^[^,]*$" nil 'noerror)
  	  (message (match-string 0)))))
  ;; v241
  ;;
  ;; *CFCLOS
  ;; *CYCLE
  ;; *ELSE
  ;; *END
  ;; *ENDDO
  ;; *ENDIF
  ;; *EXIT
  ;; *VSTAT
  ;; /AUX12
  ;; /AUX15
  ;; /AUX2
  ;; /AUX3
  ;; /EOF
  ;; /ERASE
  ;; /FCLEAN
  ;; /GO
  ;; /GOLIST
  ;; /GOPR
  ;; /MAP
  ;; /NOERASE
  ;; /NOLIST
  ;; /NOPR
  ;; /PMACRO
  ;; /POST1
  ;; /POST26
  ;; /PREP7
  ;; /QUIT
  ;; /RESET
  ;; /SOLU
  ;; AFLIST
  ;; AREAS
  ;; ATYPE
  ;; BFTRAN
  ;; BIOOPT
  ;; BOOL
  ;; CALC
  ;; CEQN
  ;; CLRMSHLN
  ;; COMPRESS
  ;; COUPLE
  ;; CURR2D
  ;; DATADEF
  ;; DEACT
  ;; DEFINE
  ;; DISPLAY
  ;; DTRAN
  ;; DYNOPT
  ;; ECPCHG
  ;; EEMBED
  ;; ELEM
  ;; EMAGERR
  ;; EMF
  ;; EMFT
  ;; EPLOT
  ;; ERASE
  ;; ETYPE
  ;; EUSORT
  ;; FCCHECK
  ;; FEBODY
  ;; FECONS
  ;; FEFOR
  ;; FESURF
  ;; FINISH
  ;; FLUXV
  ;; FTRAN
  ;; GENOPT
  ;; GEOMETRY
  ;; GPLOT
  ;; GSUM
  ;; ICDELE
  ;; INRTIA
  ;; IRLIST
  ;; KEYPTS
  ;; KEYW
  ;; KSUM
  ;; LCCALC
  ;; LCZERO
  ;; LINE
  ;; LSOPER
  ;; LSUM
  ;; MASTER
  ;; MATER
  ;; MESHING
  ;; MMF
  ;; NLOPT
  ;; NODES
  ;; NUSORT
  ;; OPERATE
  ;; OUTOPT
  ;; PAUSE
  ;; PLORB
  ;; PLOTTING
  ;; POINT
  ;; POLY
  ;; POWERH
  ;; PRERR
  ;; PRIM
  ;; PRINT
  ;; PRITER
  ;; RCON
  ;; RESET
  ;; RMFLVEC
  ;; SBCLIST
  ;; SBCTRAN
  ;; SELM
  ;; SFTRAN
  ;; SMBODY
  ;; SMCONS
  ;; SMFOR
  ;; SMSURF
  ;; SOLUOPT
  ;; SORT
  ;; SPEC
  ;; SPTOPT
  ;; SSUM
  ;; STAT
  ;; TBLE
  ;; UNPAUSE
  ;; VOLUMES
  ;; WSPRINGS

#+end_src

*** TODO Definition of Apdl_deprecated_elements_alist
Manual: deprecated/legacy/archived elements: Mechanical APDL Feature
Archive: Part IV: Archived Elements compare to
Apdl_deprecated_elements_alist
- show a recommendation over deprecated elements (insert (propertize
  "beam3" 'help-echo "beam188")
- legacy elements and their suggested replacement
  https://ansyshelp.ansys.com/account/secured?returnurl=/Views/Secured/corp/v251/en/ans_elem/EL2oldnewtable.html
- archived elements:
  https://ansyshelp.ansys.com/account/secured?returnurl=/Views/Secured/corp/v251/en/ans_arch/archlegacyelements.html

#+begin_src elisp
    ;; deprecated element list is from Ansys version
    ;; 12.0, 13.0, 14.0, 16.2, archived elements v201, v241 (none)
    (defconst Apdl_deprecated_elements_alist
      '(
        ("BEAM3"    . "BEAM188")
        ("BEAM4"    . "BEAM188")            ; legacy v162, v201
        ("BEAM23"   . "BEAM188")
        ("BEAM24"   . "BEAM188")
        ("BEAM44"   . "BEAM188")
        ("BEAM54"   . "BEAM188")
        ("CONTAC12". "CONTA178")            ; v150; v201
        ("CONTAC52". "CONTA178")            ; v162; v201
        ("CONTA171". "CONTA172")		; archived v201
        ("CONTA173". "CONTA174")		; archived v201
        ("CONTA176". "CONTA177")		; archived v201
        ("COMBIN7"  . "MPC184")
        ("FLUID79" . "Fluid29")             ; v150; v201
        ("FLUID80" . "Fluid29")             ; v150; v201
        ("FLUID81" . "Fluid29")             ; v150; v201
        ("FLUID141" . "CFX")                ; v145
        ("FLUID142" . "CFX")                ; v145
        ("INFIN9"   . "INFIN110")           ; v14
        ("INFIN47"  . "INFIN111")           ; 14
        ("PIPE16"   . "PIPE288")            ; egacy v162, v201
        ("PIPE18"   . "ELBOW290")           ; egacy v162, v201
        ("PLANE13"  . "PLANE223")           ; 14
        ("PLANE25"  . "PLANE272")           ; 14
        ("PLANE42"  . "PLANE182")		; 201
        ("PLANE53"  . "PLANE233")           ; 14
        ("PLANE67"  . "PLANE223")
        ("PLANE82"  . "PLANE183")		; 201
        ("PLANE83"  . "SOLID273")           ; 14
        ("PLANE145" . "-")                  ; -elements are out in 13.0
        ("PLANE146" . "-")
        ("CONTAC12" . "CONTA178")
        ("CONTAC52" . "CONTA178")
        ("LINK1"    . "LINK180")
        ("LINK8"    . "LINK180")
        ("LINK10"   . "LINK180")
        ("LINK32"   . "LINK33")
        ("PIPE16"   . "PIPE288")
        ("PIPE17"   . "PIPE288")
        ("PIPE18"   . "ELBOW290")
        ("PIPE20"   . "PIPE288")
        ("PIPE59"   . "PIPE288")		; archived v201
        ("PIPE60"   . "ELBOW290")
        ("SHELL41"  . "SHELL181")           ; v14
        ("SHELL43"  . "SHELL181")
        ("SHELL57"  . "SHELL131")
        ("SHELL63"  . "SHELL181")		; archived v201
        ("SHELL91"  . "SHELL281")
        ("SHELL93"  . "SHELL281")
        ("SHELL99"  . "SHELL281")
        ("SHELL150" . "-")                   ; p-elements are out in 13.0
        ("SOLID5"   . "SOLID226")            ; v14
        ("SOLID45"  . "SOLID185")		 ; archived v201
        ("SOLID46"  . "SOLID185")
        ("SOLID65" .  "SOLID185")            ; v145; v201
        ("SOLID69"  . "SOLID226")
        ("SOLID92"  . "SOLID187")		 ; archived v201
        ("SOLID95"  . "SOLID186")		 ; archived v201
        ("SOLID117" . "SOLID236")            ; v14
        ("SOLID127" . "-")                   ; p-elements are out in 13.0
        ("SOLID128" . "-")
        ("SOLID147" . "-")
        ("SOLID148" . "-")
        ("SOLID191" . "SOLID186")
        ("VISCO88"  . "PLANE183")
        ("VISCO89"  . "SOLID186")
        ("VISCO106" . "PLANE182")
        ("VISCO107" . "SOLID185")
        ("VISCO108" . "PLANE183")
        ("TRANS109" . "PLANE223")          ; v14
        )
      "Association list of deprecated element types with their proposed successor.")

#+end_src

#+RESULTS:
: Apdl_deprecated_elements_alist

*** Parametric functions
4) Manual: Parametric functions: APDL guide: chap. 3.8 ->
   apdl_parameteric_functions.txt
https://ansyshelp.ansys.com/account/secured?returnurl=/Views/Secured/corp/v251/en/ans_apdl/Hlp_P_APDL3_9.html

file:///c:/CAx/App/ANSYS_Inc/v241/commonfiles/help/en-us/help/ans_apdl/Hlp_P_APDL3_9.html

[[file:apdl_parametric_functions.txt]]

*** Get functions
5) Manual: get functions: APDL guide: Appendix A: 241
   apdl_get_function.txt
https://ansyshelp.ansys.com/account/secured?returnurl=/Views/Secured/corp/v251/en/ans_apdl/Hlp_P_APDLget.html

file:///c:/CAx/App/ANSYS_Inc/v241/commonfiles/help/en-us/help/ans_apdl/Hlp_P_APDLget.html

[[file:apdl_get_functions.txt]]

*** _Return values
I think they aren't used yet, except in templates

6) Manual:  _RETURN values APDL guide 5.6 Using the _status and _return
   parameter macros: return_status_values.txt
https://ansyshelp.ansys.com/account/secured?returnurl=/Views/Secured/corp/v251/en/ans_apdl/Hlp_P_APDL4_7.html

file:///c:/CAx/App/ANSYS_Inc/v241/commonfiles/help/en-us/help/ans_apdl/Hlp_P_APDL4_7.html

[[file:return_status_values.txt]]

*** Check DEFCONSTs in -mode.el
apdl-variable-defining-commands
[[file:../apdl-mode.el]]
** Scripted
*** Elisp helper functions
#+begin_src elisp
  ;; (defun APDL-elements (list)
  ;;       (mapcar
  ;;        '(lambda (name)
  ;;        (list
  ;;         (concat "\\<\\(" name "\\)\\>")
  ;;         1
  ;;         'font-lock-variable-name-face
  ;;         'keep               ; do not overwrite comment-faces
  ;;         ))
  ;;        list))

  (defun APDL-get-functions (list)
    (mapcar
     #'(lambda (name)
         (list
  	(concat "\\(" name "\\)\\s-*(")
  	1
  	'font-lock-function-name-face
  	'keep))
     list))

  ;; -TODO- redundant?
  ;; (defun APDL-parametric-functions (list)
  ;;   (mapcar
  ;;    #'(lambda (name)
  ;;        (list
  ;; 	(concat "\\(" name "\\)\\s-*(")
  ;; 	'(1 font-lock-function-name-face keep)))
  ;;    list))

  (defun double_entry_p(strg commands)
    "Returns t if STRG occurs twice in COMMANDS."
    (let ( (n 0) (l (length strg)) (str))
      (dolist (M commands)
        (if (> (length M) l)
  	  (setq str (substring M 0 l))
  	(setq str M))
        (if (string= str strg)
  	  (setq n (1+ n))))
      (if (> n 1)
  	t)))

  (defun make_unique( strg commands)
    "Return a sub-string of STRG which is unique in COMMANDS.
  	  The length of STRG is greater than 4 characters."
    (let ((l (length strg)) (n 4) (str ""))
      (while (<= n l)
        (setq str (substring strg 0 n))
        (if (double_entry_p str commands)
  	  (setq n (1+ n))
  	(setq n (1+ l))))
      str))

  (defun asterisk(String)
    (let ((str String))
      (if (= (elt String 0) ?*)
  	(setq str (concat "\\" str)))
      str)
    )

  (defun slice (string)
    (let* ((l (length string))
  	 (s ""))
      (dolist (c (split-string string "" t))
        (setq s (concat s "\\(?:" c)))
      (dotimes (i l s)
        (setq s (concat s "\\)?")))))

  	  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  ;; comments and strings are fontified for all levels
  ;; syntactical fontification is there

  	  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; default level when font-lock-maximum-decoration is nil (just
  ;; minimum command length) overwritten by variable defs (=)

  ;; 1.) no regard for appended chars just minimum fontification lengths
  ;;     written_out_p && if l > 4 make_unique
  ;; 2.) no regard for condensed input lines, commands first in line
  ;; 3.) undocumented commands are higlighted like documented

  	  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; level 1 this is the mode default level (official names, FIXED in
  ;; length as suggested by command completion, no additional chars are
  ;; allowed even when disregarded by the solver) The rest is the same
  ;; as level 2 except no multiline stuff

  	  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; level 2 (commands with variable fontification lengths)

  ;; a.) regexp for commands which do not allow characters behind it
  ;;     1.) written_out_p
  ;;     2.) length < 4  TODO: is this true? e. g. *if

  ;; TODO: check whether a.) and b.) is not congruent except *elseif
  ;; b.) regexp for commands which do not allow parameters behind it
  ;;     1.) no_parameter_p Apdl_commands_without_arguments
  ;;     2.) not written_out_p
  ;; TODO: what is with $ condensation?

  ;; c.) regexp for commands which allow characters and arguments behind it
  ;;     1.) length >= 4 but not unique

  (defun written_out_p(STRING)
    "Returns true if STRING is a member of
  	    \"Apdl_written_out_commands\""
    (member STRING Apdl_written_out_commands))

  ;; (written_out_p "*END")

  (defun Prepare_list (List)
    "Simplified fontification v12.
  	  Argument LIST is a list of ansys commands. Return a list of
  	  command strings"
    (let ( tmp tmp2 tmp_list l l2)
      (message "Preparing APDL font lock strings, list-length: %d." (length List))
      (dolist (M List tmp_list)
        (setq l (length M))
        (cond ((written_out_p M)
  	     (setq tmp_list (cons M tmp_list)))
  	    ((<= l 4)               ; shorter stuff
  	     (setq tmp_list (cons M tmp_list)))
  	    (t ;; long command names
  	     (setq tmp (make_unique M List)
  		   tmp_list (cons tmp tmp_list)))))))

  (defun Overlapping (strg l)
    "Return a list of a sequences of strings starting from L up to
  	  the length of the original string STRG."
    (let (lisy
  	(n1 (length strg)))
      (when (> l n1)
        (error "string length too small"))
      (dotimes (i (1+ (- n1 l)) lisy)
        (setq lisy (cons (substring strg 0 (- n1 i)) lisy)))))

  ;; -TODO-: we are still neglecting commands without parameters!
  (defun Prepare_list_2 (List)
    "Return a list of 3 lists for level 2.
  	  Written out commands and 2 lists of commands which the solver
  	  allows characters appended behind."
    (let ( tmp tmp_list list_a list_b list_c l l2)
      (message "Preparing APDL font lock 2 strings...")
      (dolist (M List)
        (setq l (length M))
        (cond  ; written out stuff
         ((written_out_p M)
  	(setq list_a (cons M list_a)))
         ((< l 4)               ; short stuff
  	(setq list_a (cons M list_a)))
         ;; variable ending stuff
         ((= l 4)
  	(setq tmp_list (cons M tmp_list)))
         (t ;; the rest, longer command names
  	(setq tmp (make_unique M List)
  	      l2 (length tmp)
  	      tmp (Overlapping M l2)
  	      tmp_list (append tmp tmp_list)))))

      (setq l2 (/ (length tmp_list) 2)
  	  list_b (butlast tmp_list l2)
  	  list_c (last tmp_list l2))
      (message "length_a: %d length_b: %d length_c: %d"
  	     (length list_a) (length list_b) (length list_c) )
      (list list_a list_b list_c)))

  (message "read apdl functions")

#+end_src

#+RESULTS:
: read apdl functions

Parameter help M-? <-> dynprompt241.ans (command arguments) +
Hlp_C_CmdTOC.html (short help) +
Apdl_undocumented_commands

- Online table of contents (with all commands):
  https://ansyshelp.ansys.com/account/secured?returnurl=/Views/Secured/corp/v251/en/ans_cmd/Hlp_C_CmdTOC.html
- Undocumented commands compiled from release notes
  https://ansyshelp.ansys.com/account/secured?returnurl=/Views/Secured/corp/v251/en/mapdl_releasenotes/rncmdchg.html%23rnundoccmds

*** apdl_keywords.txt
Create helper file for the M-? overlays

#+begin_src elisp
  (let* (
         (Dynprompt-path (concat Installation-folder "/ansys/docu/dynprompt" Ansys-version ".ans") )
         (CmdTOC-path (concat Installation-folder
  			    "/commonfiles/help/en-us/help/ans_cmd/Hlp_C_CmdTOC.html"))
         (Target-folder "~/analyst/apdl-mode/prepare_keywords/")
         (Cmd-regex "refentrytitle\".*</span></dt>")
         ;; (Cmd-regex (concat
         ;; 		   "\\(<dt><span class=\"refentrytitle\">\\)"
         ;; 		   "\\(.*?\\)"
         ;; 		   "\\(</span></dt>\\)"))
         (Purpose-str "class=\"refpurpose\">")
         (Keywords-file "apdl_keywords.txt")
         (Keywords-path (concat Target-folder "apdl_keywords.txt"))
         Str
         Command
         Purpose P1 P2
         )
    (unless (file-exists-p CmdTOC-path)
      (error "%s" (concat CmdTOC-path " does not exist")))
    (delete-file Keywords-path 'trash)
    (with-temp-buffer
      (message (concat "Inserting Ansys keywords in " Target-folder Keywords-file ))
      (insert-file-contents CmdTOC-path)
      (insert "\n")
      (delete-trailing-whitespace)	;cleanup
      (goto-char (point-min))
      ;;(search-forward "Connection Commands")
      ;;(while (re-search-forward Cmd-regex nil 'noerror)
      (while (setq P1 (search-forward "refentrytitle\">" nil 'noerror) )
        (setq P2 (search-forward "</span></dt>" nil 'noerror) )
        ;; Define Str and remove newlines in it
        ;;(setq Str (replace-match (buffer-substring-no-properties P1 P2) "\n") )
        (setq Str (buffer-substring-no-properties P1 P2) )
        ;;(message Str)
        (setq Str (replace-regexp-in-string "\n" "" Str) )
        (if (string= Str nil)
  	  (error (format "String is %s" Str) ) )
        ;; command name
        (string-match ">\\(.*?\\)</a></span>" Str)
        (setq Command (match-string 1 Str))
        ;; Purpose
        (string-match (concat Purpose-str "\\(.*?\\)</span>") Str)
        (setq Purpose (match-string 1 Str))
        ;;(message (concat Command Purpose))
        (append-to-file (concat Command Purpose "\n") nil Keywords-path)
        ))
      ;;(find-file-literally Keywords-path)
      (find-file Keywords-path)
      ;; ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
      ;; clean remaining html tags
      (goto-char (point-min) )
      (while (re-search-forward "<[^<]*>" (point-max) t)
        (message (replace-match "")))
      ;; workaround: replace commas with semi-colons in
      ;; description otherwise argument counting hickups in M-?
      (goto-char (point-min))
      (while (re-search-forward "," (point-max) t)
        (message (replace-match ";")))
      ;; remove whitespace at the line beginning
      (goto-char (point-min))
      (replace-regexp "^\\s-+" "")
      ;; replace multiple spaces with one space
      (goto-char (point-min) )
      (replace-regexp " +" " ")
      ;; ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
      ;; insert Dynprompts
      (goto-char (point-max) )
      ;;otherwise first Dynprompt line will be added to a command
      (insert "\n")
      ;;include command descriptions
      (insert-file-contents Dynprompt-path)
      (setq sort-fold-case t)
      (sort-lines nil (point-min) (point-max))
      ;; save buffer
      (save-buffer)
      (message (format "Saved \"%s\"" Keywords-file))
    )

#+end_src

#+RESULTS:
: Saved apdl_keywords.txt

*** start apdl-keyword.el
Include header and apdl-dynamic-prompt
#+begin_src elisp

  (let ((Buffer (find-file "../apdl-keyword.el"))
  	(Command-list))
    (cd "prepare_keywords")
    (with-temp-buffer
      (insert-file-contents "prepare_keywords/apdl_keywords.txt")
      (while (re-search-forward "^\\(.\\w*\\>\\).*\n\\1.*" nil t)
        (add-to-list 'Command-list (match-string 0) 'append)))
    ;; now include the undocumented commands
    (setq Command-list
  	(append Command-list
  		(mapcar #'(lambda (m)
  			    (concat m " - APDL undocumented or archived commands\n" m))
  			Apdl_undocumented_commands)))
    (set-buffer Buffer)
    (erase-buffer)
    ;;(goto-char (point-min))
    ;; ---------- header ----------
    (insert
     ";;; apdl-keyword.el --- APDL-Mode completion and highlighting variables -*- lexical-binding:t -*-\n"
     "\n"
     ";; Copyright (C) 2006 - 2025 H. Dieter Wilhelm\n"
     "\n"
     ";; Author: H. Dieter Wilhelm <dieter@duenenhof-wilhelm.de>\n"
     ";; Version: 20.7.0\n"
     ";; Package-Requires: ((emacs \"25\"))\n"
     ";; Keywords: languages, convenience, tools, Ansys, APDL\n"
     ";; URL: https://github.com/dieter-wilhelm/apdl-mode\n"
     "\n"
     ";; Maintainer: H. Dieter Wilhelm\n"
     "\n"
     ";; This program is free software; you can redistribute it and/or modify\n"
     ";; it under the terms of the GNU General Public License as published by\n"
     ";; the Free Software Foundation; either version 2, or (at your option)\n"
     ";; any later version.\n"
     "\n"
     ";; This lisp script is distributed in the hope that it will be useful,\n"
     ";; but WITHOUT ANY WARRANTY; without even the implied warranty of\n"
     ";; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.\n"
     "\n"
     ";; Permission is granted to distribute copies of this lisp script\n"
     ";; provided the copyright notice and this permission are preserved in\n"
     ";; all copies.\n"
     "\n"
     ";; You should have received a copy of the GNU General Public License\n"
     ";; along with this program; if not, you can either send email to this\n"
     ";; program's maintainer or write to: The Free Software Foundation,\n"
     ";; Inc.; 675 Massachusetts Avenue; Cambridge, MA 02139, USA.\n"
     "\n"
     ";;; Commentary:\n"
     ";; This file was built by build-keywords.el!\n"
     "\n"
     ";;; Code:\n"
     "\n")

    (insert "(defconst apdl-dynamic-prompt\n'")
    (setq print-length nil)          ; nil: print all members of list
    (prin1 Command-list Buffer)
    (insert "\n\"Help strings for the parameters of APDL keywords.\")\n\n")
    (save-buffer Buffer)
    (message (concat "apdl-dynamic-prompt...done " (current-time-string)))
      )
#+end_src

#+RESULTS:
: apdl-dynamic-prompt...done Mon May 12 21:13:22 2025

*** Create element library apdl_elements.txt
Element list starts in toc.html chapt. 7. Element Library
2) Manual: Element names: toc.toc -> toc.html -> eww copy element list
   to helper/apdl_elements.txt
https://ansyshelp.ansys.com/account/secured?returnurl=/Views/Secured/corp/v251/en/ans_elem/Hlp_E_ElemTOC.html

better summary (of element types) than above?
https://ansyshelp.ansys.com/account/secured?returnurl=/Views/Secured/corp/v251/en/ans_elem/Hlp_E_CH3_2.html


#+begin_src elisp
  ;;"7. Element Library"
  ;;(setq debug-on-message "Debug")
  ;; WARNING there are lots of linebreaks between the html <span refpurpose> </span>
  ;; tags!!!

  ;;"<span class=\"structname\">SOLID5</span></a></span>"
  ;;"<span class=\"refpurpose\"> - 3D Coupled-Field Solid</span>"
  (let (Command Purpose Str P1 P2 (Out-file "apdl_elements.txt"))
    (with-temp-buffer
      ;;(setq coding-system-for-read 'utf-8-dos)
      (insert-file-contents
       (concat Installation-folder
  	     "/commonfiles/help/en-us/help/ans_elem/toc.toc") nil nil nil 'replace)
      (search-forward "7. Element Library")
      (append-to-file "--\n" nil Out-file)
      (setq case-fold-search t)
      ;(message "Debug")
      (delete-file Out-file 'trash)
      (while
  	(setq P1 (search-forward "<span class=\"structname\">" nil 'noerror 1))
        ;; search for the follwing refpurpose span
        (search-forward "<span class=\"refpurpose\">" nil 'noerror 1)
        ;; and search for the closing span tag
        (setq P2 (search-forward "</span>" nil 'noerror 1))
        (setq Str (buffer-substring-no-properties P1 P2))
        ;; remove the linebreaks in the refpurpose span
        (setq Str (replace-regexp-in-string "\n" "" Str))
        ;; command name
        (string-match "\\(.*?\\)</span>" Str)
        (setq Command (match-string 1 Str))
        ;; Purpose
        (string-match "refpurpose\">\\(.*?\\)</span>" Str)
        (setq Purpose (match-string 1 Str))
        (message (concat Command Purpose))
        (append-to-file (concat Command Purpose "\n") nil Out-file)))
    (message (format "Build \"%s\"" Out-file))
    )

#+end_src

#+RESULTS:
: Build "apdl_elements.txt"

3) mapping of command and html help: ansys_Index.hlp

# Dynpromts + ElemntNames + Keywords + HelpIndex
# python script is outdated because of html changes ;-)

old?

#+begin_src elisp :tangle no
  (let* (
	 (Folder (concat Installation-folder "/ansys/docu/") )
	 (Dynprompt-file (concat Folder "dynprompt" Ansys-version ".ans") )
	 (Target-folder "~/analyst/apdl-mode/ansys/")
	 (Element-file (concat Base "ANSYS_Inc/v" Version
			   "/commonfiles/help/en-us/help/ans_elem/toc.toc"))
	 (Command-file (concat Base "ANSYS_Inc/v" Version
			       "/commonfiles/help/en-us/help/ans_cmd/Hlp_C_CmdTOC.html"))
	 (Help-index (concat Base "ANSYS_Inc/v" Version
			     "/commonfiles/help/ansys_Index.hlp"))
	 (Regex   (concat
		   "\\(<dt><span class=\"refentrytitle\">\\)"
		   "\\(.*?\\)"
		   "\\(</span></dt>\\)"))
	 (Purpose-str "class=\"refpurpose\">")
	 (Keywords-file "prepare_keywords/apdl_keywords.txt")
	 )
    (message (concat "Copy Ansys commands to " Target-folder Keywords-file ) )
    (copy-file Dynprompt-file Target-folder 'overwrite)
    (copy-file Element-file Target-folder 'overwrite)
    (copy-file Help-index Target-folder 'overwrite)
    ;; ;; build apdl_keywords.txt from Command-file Hplp_C_CmdTOC.html
    ;; (with-temp-buffer
    ;;   (insert-file-contents Command-file)
    ;;   ;;(with-temp-file (concat Target-folder "apdl_keywords.txt")
    ;;   ;;(setq P1 (re-search-forward "\\(<dt><span class=\"refentrytitle\">\\)"))
    ;;   ;;(setq P1 (search-forward "<dt><span class=\"refentrytitle\">"))
    ;;   ;;(re-search-forward "</span></dt>")
    ;;   ;;(search-forward "</span></dt>")
    ;;   ;;(setq P2 (match-beginning 0))
    ;;   (message (concat "Inserting Ansys keywords in " Target-folder Keywords-file ))
    ;;   (delete-file (concat Target-folder Keywords-file) 'trash)
    ;;   (append-to-file (concat Target-folder Keywords-file) nil
    ;; 		    (concat "# Keyword/commands of Ansys" Version) )
    ;;   (append-to-file (concat Target-folder Keywords-file) nil
    ;; 		    "# from Hlp_C_CmdTOC.html" )
    ;;   (while (re-search-forward Regex nil 'noerror)
    ;;     (setq Str (match-string 2) )
    ;;     ;; command name
    ;;     (string-match ">\\(.*?\\)</a></span>" Str)
    ;;     (setq Command (match-string 1 Str))
    ;;     ;; Purpose
    ;;     (string-match (concat Purpose-str "\\(.*\\)") Str)
    ;;     (setq Purpose (match-string 1 Str))
    ;; 					;(message (concat Command Purpose))
    ;;     (append-to-file (concat Command Purpose "\n") nil (concat Target-folder Keywords-file) )
    ;;     ;;(insert Command Purpose)
    ;;     )
    ;;   )
					  ;)
    ;; ;; remove remaining html tags
    ;; (find-file (concat Target-folder Keywords-file))
    ;; (goto-char (point-min))
    ;; ;;(while (re-search-forward "<\\([^<]*\\)>" (point-max) t)
    ;; (while (re-search-forward "<[^<]*>" (point-max) t)
    ;;   (message (replace-match "\\1")))
    ;; (save-buffer)
    )

#+end_src

#+RESULTS:

*** fontification variables, conclude -keywords.el
Build the (fontification) variables in apdl-keywords.el
#+begin_src elisp
  ;; create -keywords.el
  ;;(cd "~/analyst/apdl-mode/ansys")
  (let (
        (Keyword-file "C:/Users/uidg1626/OneDrive - Vitesco Technologies/analyst/apdl-mode/prepare_keywords/apdl_keywords_debug.txt")
        (Buffer (find-file "../apdl-keyword.el"))
        List
        commands
        commands-1
        undocumented-commands
        get-functions
        parameteric-functions
        elements
        deprecated_elements
        list1
        list2
        list3
        )
    (set-buffer Buffer)
    ;;(delete-region (point-min) (point-max))

    ;; ---------- undocumented commands ----------

    ;; getting another colour than regular commands

    (setq undocumented-commands Apdl_undocumented_commands)
    (insert "(defconst apdl-undocumented-command-regexp\n")
    (prin1 (regexp-opt Apdl_undocumented_commands) Buffer)
    (insert "\n\"Regexp of commands not documented in the Ansys manuals.
  Seen mainly in Workbench output files and Ansys verification models.\")\n\n")
    ;; (beginning-of-defun)
    ;; (fill-paragraph 0)
    (message "undocumented commands...done")

    ;; ---------- command parameter help ----------

    (setq List nil)
    ;; first fill List with documented commands
    (with-temp-buffer
      (insert-file-contents Keyword-file)
      ;;(insert-file-contents "apdl_dynprompt.txt")
      (delete-matching-lines "^#.*" (point-min) (point-max))
      ;;(setq sort-fold-case t)
      ;;(sort-lines nil (point-min) (point-max))
      ;; (write-file "keyw+promt.txt")
      (goto-char (point-min))
      (while (re-search-forward "^\\(.\\w*\\>\\).*\n\\1.*" nil t)
        (add-to-list 'List (match-string 0) 'append)))
    ;; now include the undocumented commands
    (setq List
  	(append List
  		(mapcar #'(lambda (m)
  			    (concat m " - APDL undocumented command\n" m))
  			Apdl_undocumented_commands)))
    ;;  (sort list 'string<)
    (set-buffer Buffer)

    (insert "(defconst apdl-dynamic-prompt\n'")
    (setq print-length nil)          ; nil: print all members of list
    (prin1 List Buffer)
    (insert "\n\"Help strings for the parameters of APDL keywords.\")\n\n")
    (message "command parameter help...done")

    ;; no formatting, it interferes with the output!

    ;; ---------- keywords ----------

    ;; ----- documented + written out + undocumented commands ---
    ;; 0.) unique, solver type
    ;; 1.) full APDL name same as completed
    ;; 2.) from unique to full name

    (setq List ())               ; initialise list
    (with-temp-buffer
      (insert-file-contents Keyword-file)
      ;;    (setq sort-fold-case t)
      ;;    (sort-lines nil (point-min) (point-max))
      (delete-matching-lines "^#.*" (point-min) (point-max))
      (goto-char (point-min))
      (while (re-search-forward "^.\\w*\\>" nil t)
        (add-to-list 'List (match-string 0) 'append)))

    ;; search list
    (if (member "*DPF" List)
  	(message "List contains \"*DPF\"."))


    (set-buffer Buffer)
    ;;(setq commands (delete-dups List))
    (setq commands List)

    (message "Starting minimal level.")

    (setq commands-1 (append commands Apdl_undocumented_commands))
    ;;  (debug)
    (insert "(defconst apdl-command-regexp\n")
    (setq print-length nil)          ; nil: print all members of list
    (prin1 (regexp-opt (Prepare_list commands-1))
  	 Buffer)
    (insert "\n\"APDL short keyword name regexp.\")\n\n")


    (if (member "*DPF" (Prepare_list commands-1))
        (message "Prepared list contains \"*DPF\".")
      (message "Prepared list doesn't contain \"*DPF\"."))

    (message "starting level 1.")

    (insert "(defconst apdl-command-regexp-1\n")
    (prin1 (regexp-opt commands)
  	 Buffer)
    (insert "\n\"APDL full keyword name regexp.\")\n\n")

    (message "starting level 2.")

    ;;  regexp becoming too big for font-lock!!! when keywords are around 4000
    (setq list (Prepare_list_2 commands)
  	list1 (car list)
  	list2 (nth 1 list)
  	list3 (nth 2 list)
  	list1 (regexp-opt list1)     ; written out stuff
  	list2 (regexp-opt list2)
  	list3 (regexp-opt list3))
    (insert "(defconst apdl-command-regexp-2a\n")
    (prin1 list1 Buffer)
    (insert "\n\"APDL keyword name regexp 2a.\")\n\n")

    (insert "(defconst apdl-command-regexp-2b\n")
    (prin1 list2 Buffer)
    (insert "\n\"APDL keyword name regexp 2b.\")\n\n")

    (insert "(defconst apdl-command-regexp-2c\n")
    (prin1 list3 Buffer)
    (insert "\n\"APDL keyword name regexp 2c.\")\n\n")

    ;; ---------- Ansys elements ----------

    ;; --- regular elements ---
    (setq list ())               ; initialise list
    (with-temp-buffer
      (insert-file-contents "apdl_elements.txt")
      ;;    (setq sort-fold-case t)
      ;;    (sort-lines nil (point-min) (point-max))
      (delete-matching-lines "^#.*" (point-min) (point-max))
      (goto-char (point-min))
      (while (re-search-forward "^\\w+\\>" nil t)
        (add-to-list 'list (match-string 0) 'append)))
    (setq elements list)          ; needed for completion list
    (set-buffer Buffer)

    (insert (concat
  	   "(defconst apdl-element-regexp\n"))
    (setq print-length nil)          ; nil: print all members of list
    (prin1 (regexp-opt list 'words) Buffer)
    (insert "\n\"APDL elements regexp.\")\n\n")
    ;;(beginning-of-defun)
    (fill-paragraph 0)

    ;; --- deprecated elements ---

    (insert (concat
  	   "(defconst apdl-deprecated-element-regexp\n"))
    (setq print-length nil)          ; nil: print all members of list
    (setq deprecated-elements (mapcar 'car Apdl_deprecated_elements_alist))
    (prin1 (regexp-opt deprecated-elements 'words) Buffer)
    (insert "\n\"APDL deprecated elements regexp.\")\n\n")
    ;;(beginning-of-defun)
    (fill-paragraph 0)
    ;; -- write out the alist for a possible reference --

    (insert (concat
  	   "(defconst apdl-deprecated-element-alist\n'"))
    (setq print-length nil)          ; nil: print all members of list
    (setq deprecated-elements (mapcar 'car Apdl_deprecated_elements_alist))
    (prin1 Apdl_deprecated_elements_alist Buffer)
    (insert "\n\"Association list for APDL deprecated elements.
  Together with their proposed replacements.\")\n\n")
    ;;(beginning-of-defun)
    (fill-paragraph 0)
    (message "elements...done")

    ;; ---------- get functions ----------

    (setq list ())               ; initialise list
    (with-temp-buffer
      (insert-file-contents "apdl_get_functions.txt")
      ;;    (setq sort-fold-case t)
      ;;    (sort-lines nil (point-min) (point-max))
      (delete-matching-lines "^#.*" (point-min) (point-max))
      (goto-char (point-min))
      (while (re-search-forward "^\\(\\w+\\)(" nil t)
        (add-to-list 'list (match-string 1) 'append)))
    (setq get-functions list)     ; we need this variable for the completions!
    (setq apdl--get-functions
  	(mapcar
  	 (lambda (s) (list (concat s "(") "ans_apdl/Hlp_P_APDLget.html"))
  	 list))
    (set-buffer Buffer)

    (insert (concat
  	   "(defconst apdl-get-function-regexp\n"))
    (setq print-length nil)          ; nil: print all members of list
    (prin1 (regexp-opt get-functions) Buffer)
    (insert "\n\"APDL get function regexp.\")\n\n")
    ;;(beginning-of-defun)
    (fill-paragraph 0)
    (message "get-functions...done")

    ;; ---------- parametric functions ----------

    (setq list ())               ; initialise list
    (with-temp-buffer
      (insert-file-contents "apdl_parametric_functions.txt")
      ;;    (setq sort-fold-case t)
      ;;    (sort-lines nil (point-min) (point-max))
      (delete-matching-lines "^#.*" (point-min) (point-max))
      (goto-char (point-min))
      (while (re-search-forward "^\\(\\w+\\)(" nil t)
        (add-to-list 'list (match-string 1) 'append)))
    (setq parametric-functions list) ; we need this later for completions!
    ;; that is for -browse-help
    (setq apdl--parametric-functions
  	(mapcar
  	 (lambda (s) (list (concat s "(") "ans_apdl/Hlp_P_APDL3_9.html"))
  	 list))
    (set-buffer Buffer)

    (insert (concat
  	   "(defconst apdl-parametric-function-regexp\n"))
    (setq print-length nil)          ; nil: print all members of list
    (prin1 (regexp-opt parametric-functions) Buffer)
    (insert "\n\"APDL parametric function regexp.\")\n\n")
    ;;(beginning-of-defun)
    (fill-paragraph 0)
    (message "parametric functions...done")

    ;; ---------- completions ----------

    (setq get-functions
  	(mapcar #'(lambda (s) (concat s "()")) get-functions))
    (setq parametric-functions
  	(mapcar #'(lambda (s) (concat s "()")) parametric-functions))
    (insert "(defconst apdl-completions\n'")
    (setq print-length nil)          ; nil: print all members of list
    (prin1 (append
  	  elements
  	  deprecated-elements
  	  get-functions
  	  parametric-functions
  	  commands
  	  undocumented-commands
  	  ) Buffer)
    ;; (prin1 commands Buffer)
    ;;  Buffer)
    (insert "\n\"APDL symbols for completion in APDL-Mode.
  By default APDL keywords, get-functions, parametric-function and elements
  - deprecated as well - are completed.\")\n\n")
    ;; (beginning-of-defun)
    ;; (fill-paragraph nil)
    (message "completions...done")

    ;; ---------- help index ----------

    (message "starting help index.")
    (with-temp-buffer
      (setq list ())               ; initialise list
      (insert-file-contents (concat
  			   Installation-folder
  			   "/commonfiles/help/ansys_Index.hlp"))
      ;; clean up redundant keywords
      (delete-matching-lines "^Hlp")

      (while (re-search-forward "^SHELLS" nil t)
        (replace-match "\"SHELLS\"" nil nil)) ; unique v201
      (goto-char (point-min))
      (while (re-search-forward "^PLANE " nil t) ; unique v201
        (replace-match "\"PLANES\"" nil nil))
      (goto-char (point-min))
      (while (re-search-forward "^SOLID " nil t) ; uniqe v201
        (replace-match "\"SOLIDS\"" nil nil))
      (goto-char (point-min))
      ;;!!! Replace suffix ALL with "ALL", EXCEPT for "allsel" off course!!!
      (while (re-search-forward "^ALL[^S][^E][^L]" nil t)
        (replace-match "\"all\"" nil nil))
      (goto-char (point-min))
      ;; skip the first line
      (forward-line)
      ;; (dotimes (i 10) (re-search-forward
      (while (re-search-forward
  	    "^\\([^[:space:]]+\\)[[:space:]]+\\([^[:space:]]+\\)$" nil t)
        (add-to-list 'list (list (match-string 1) (match-string 2)) 'append)))
    (add-to-list 'list
  	       (list "\"RELEASE NOTES\"" "ai_rn/global_releasenotes.html") 'append)
    (add-to-list 'list
  	       (list "\"CONTACT TECHNOLOGY GUIDE\"" "ans_ctec/ctectoc.html") 'append)
    (add-to-list
     'list (list
  	  "\"PARAMETRIC DESIGN LANGUAGE GUIDE\""
  	  "ans_apdl/Hlp_P_APDLTOC.html") 'append)
    (add-to-list 'list
  	       (list "\"STRUCTURAL ANALYSIS GUIDE\"" "ans_str/Hlp_G_StrTOC.html")
  	       'append)
    (add-to-list 'list
  	       (list "\"ADVANCED ANALYSIS TECHNIQUES GUIDE\""
  		     "ans_str/Hlp_G_AdvTOC.html") 'append)
    (add-to-list 'list
  	       (list "\"MATERIAL MODELS\"" "ans_mat/ans_mat.html") 'append)
    (add-to-list 'list
  	       (list "\"THEORY REFERENCE\""
  		     "ans_thry/ansys.theory.html") 'append)

    ;; add the functions to the apdl-help-index
    (mapc (lambda (l) (add-to-list 'list l 'append)) apdl--parametric-functions)
    (mapc (lambda (l) (add-to-list 'list l 'append)) apdl--get-functions)

    (message "adding help index...")
    (set-buffer Buffer)

    (insert (concat
  	   "(defconst apdl-help-index\n'"))
    (setq print-length nil)          ; nil: print all members of list
    (prin1 list Buffer)
    (insert "\n\"Ansys help index alist.\")\n\n")
    ;;(beginning-of-defun)

    (message "help index...done.")

    (insert "(provide 'apdl-keyword)\n\n;;; apdl-keyword.el ends here\n")

    (save-buffer)
    (message "apdl-keywords.el done.")
    )

#+end_src

#+RESULTS:
: apdl-keywords.el done.

** tangle this file
org-babel-tangle-file
C-c C-v t (current buffer)
